In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi={"Istanbul":[30,29,np.nan], "Ankara":[20,np.nan,25], "Izmir":[40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [4]:
havaDurumuDataFrame.dropna(axis= 0)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [5]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [6]:
havaDurumuDataFrame.dropna(axis= 1)

   Izmir
0     40
1     39
2     38

In [7]:
yeniVeri ={"Istanbul":[30,29,np.nan], "Ankara":[20,np.nan,25], "Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [8]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [9]:
yeniDataFrame.dropna(axis=1,thresh=2)
#threshold #bir "sütundaki" en az 2 NaN değeri olması ve o sütunun kaldırılması şartını belirtir.

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [10]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [11]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [12]:
maasSozlugu = {"Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Çalisan Ismi": ["Ahmet","Mehmet","Atıl","Semih","Zeynep","Fatma"],
               "Maas" : [100,150,200,300,400,500],
               }

In [13]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [14]:
maasDataFrame

   Departman Çalisan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atıl   200
3  Pazarlama        Semih   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [15]:
grupObjesi = maasDataFrame.groupby("Departman")

In [16]:
grupObjesi.count()

           Çalisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [19]:
#grupObjesi.mean() #departmandaki kişilerin ortalama maaşını görebiliyorum. ama göremiyorum hata veriyor ilginç...

In [20]:
grupObjesi.max()

          Çalisan Ismi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama        Semih   300
Yazılım         Mehmet   150

In [21]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0